package ClassTest;

public class Classexplan {
//	객체 - 실제로 존재하는 것 . 사물 or개념 
//	클래스 용도 = 객체 생성하는데 사용함 
//	
//	유형객체 = 책상 의자 자동차 
//	무형객체 = 수학공식 , 프로그램 논리 
//	
//	인스턴스 = 클래스로부터 객체를 만드는 과정 
	
//	인스턴스 == 객체 
	
//	객체 구성요소 
//	속성 (property)-멤버 변수 ,필드 ,상태 
//	기능 (function)- 메서드, 함수 ,행동 

	//tv객체 필요 -> 클래스 설계 
//
//객체의 속성과 기능 구별 
//속성 :크기 (width , heigth , led,색상 ,볼륨 ,채널 )->멤버변수로 만듦
//	기능 : 채널변경 , 전원 여부 , 볼륨 변경 ->메서드로 만듦
	
//	만드는 순서 :클래스 설계- 인스턴스 (객체)의 생성과 사용
//	
//	tv t; tv  클래스타입의 참조변수 t선언 
//	t = new tv();  tv인스턴스를 생성한 후 생성된 tv인스턴스 주소를 t에 저장  

//	생성자 - 무조건 있어야한다 
//	생성자의 모양은 클래스의 이름과 동일해야한다 .괄호와 중괄호도 반드시 있어야한다.
	//생성자는 여러개 만들수 있다 - 오버로딩 
//	괄호 안의 형태는 달라야 한다 . 

//	생성자 목적:객체 생성시 사용 
	
//	TV tv = new TV()
//	TV tv2 = new TV()	
	
	//메소드 (== 함수 	)
//특정 작업을 수행하는 여러 줄의 문장을 하나로 묶은 것 
//	메소드 목적 
//	재사용성, 중복된 코드 제거 , 프로그램 구조화
	//리턴타입 정하고 메소드명 (){}
//..리터타입은 (기본타입,참조타입 배열, 클래스 int ,double ,ahar)	
	
}
